experiments/results/logs/burst-hpa-001/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6560.805ms, rate sampling interval: 16293ms
  Thread calibration: mean lat.: 6623.838ms, rate sampling interval: 16310ms
  Thread calibration: mean lat.: 6626.934ms, rate sampling interval: 15089ms
  Thread calibration: mean lat.: 6534.409ms, rate sampling interval: 14475ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96m    27.67s    1.72m    57.40%
    Req/Sec     3.23      0.42     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96m 
 75.000%    1.38m 
 90.000%    1.60m 
 99.000%    1.70m 
 99.900%    1.72m 
 99.990%    1.73m 
 99.999%    1.73m 
100.000%    1.73m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9920.511     0.000000            1         1.00
   20316.159     0.100000          172         1.11
   28868.607     0.200000          344         1.25
   37421.055     0.300000          517         1.43
   47251.455     0.400000          688         1.67
   57835.519     0.500000          858         2.00
   62980.095     0.550000          944         2.22
   67895.295     0.600000         1032         2.50
   72417.279     0.650000         1117         2.86
   78053.375     0.700000         1202         3.33
   82575.359     0.750000         1289         4.00
   84082.687     0.775000         1333         4.44
   86835.199     0.800000         1373         5.00
   89063.423     0.825000         1419         5.71
   91357.183     0.850000         1460         6.67
   94896.127     0.875000         1504         8.00
   95551.487     0.887500         1523         8.89
   96337.919     0.900000         1545        10.00
   97714.175     0.912500         1567        11.43
   98762.751     0.925000         1590        13.33
   99549.183     0.937500         1609        16.00
   99876.863     0.943750         1623        17.78
  100270.079     0.950000         1635        20.00
  100466.687     0.956250         1642        22.86
  100990.975     0.962500         1652        26.67
  101384.191     0.968750         1664        32.00
  101515.263     0.971875         1670        35.56
  101580.799     0.975000         1678        40.00
  101646.335     0.978125         1681        45.71
  101711.871     0.981250         1688        53.33
  101777.407     0.984375         1691        64.00
  101842.943     0.985938         1692        71.11
  101974.015     0.987500         1695        80.00
  102170.623     0.989062         1698        91.43
  102301.695     0.990625         1700       106.67
  102563.839     0.992188         1704       128.00
  102563.839     0.992969         1704       142.22
  102694.911     0.993750         1707       160.00
  102694.911     0.994531         1707       182.86
  102760.447     0.995313         1709       213.33
  102891.519     0.996094         1711       256.00
  102891.519     0.996484         1711       284.44
  102891.519     0.996875         1711       320.00
  102957.055     0.997266         1714       365.71
  102957.055     0.997656         1714       426.67
  102957.055     0.998047         1714       512.00
  102957.055     0.998242         1714       568.89
  102957.055     0.998437         1714       640.00
  102957.055     0.998633         1714       731.43
  102957.055     0.998828         1714       853.33
  103022.591     0.999023         1715      1024.00
  103022.591     0.999121         1715      1137.78
  103022.591     0.999219         1715      1280.00
  103022.591     0.999316         1715      1462.86
  103022.591     0.999414         1715      1706.67
  103546.879     0.999512         1716      2048.00
  103546.879     1.000000         1716          inf
#[Mean    =    57763.021, StdDeviation   =    27672.125]
#[Max     =   103481.344, Total count    =         1716]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1826 requests in 2.00m, 18.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 4154
Requests/sec:     15.20
Transfer/sec:    159.58KB